%--多节点谐波源参数
zx3_5 =3.186346705256126 - 0.760637203888073i;  ix3_5 =8.151110547543958 - 0.720302069510718i;
zx3_7 =2.163737528633183 - 1.248191258383985i;  ix3_7 =4.084938375185587 - 0.532892757075021i;
zx3_11 =1.540464141370687 - 2.429000990105695i;  ix3_11 =-2.656272326108159 + 0.695882642500893i;
zx3_13 =1.036641793920883 - 2.191341985825292i;  ix3_13 =-1.884151302929068 + 0.559945027703014i;
zx3_17 =-0.677710757182612 - 1.303317346305666i;  ix3_17 =1.608753836319880 + 0.009277515688157i;
zx3_19 = -0.116389073388037 - 1.381589358923610i;  ix3_19 =1.485397664622903 - 0.609449466782032i;
Yx3=[1./zx3_5 1./zx3_7 1./zx3_11 1./zx3_13 1./zx3_17 1./zx3_19];
Ix3=[ix3_5 ix3_7 ix3_11 ix3_13 ix3_17 ix3_19];
zx4_5 = 33.848192472113048 -18.789719574664119i;  ix4_5 =2.179644371307110 - 0.496874126981752i;
zx4_7 =51.550109714639831 + 6.377859141592313i;  ix4_7 = 1.028811953848638 - 0.461579262480564i;
zx4_11 =18.965832382555295 -31.529862638803895i;  ix4_11 =-0.717451705930272 + 0.471340461937304i;
zx4_13 =-55.795975745759534 -74.961157734152039i;  ix4_13 =-0.409783390752299 + 0.405706426111617i;
zx4_17 =-19.844755615413906 -23.157913346056400i;  ix4_17 = 0.283313630084987 - 0.374818143358390i;
zx4_19 =-23.043554388930783 - 0.442903618235462i;  ix4_19 =0.131332840479410 - 0.312925038664046i;
Yx4=[1./zx4_5 1./zx4_7 1./zx4_11 1./zx4_13 1./zx4_17 1./zx4_19];
Ix4=[ix4_5 ix4_7 ix4_11 ix4_13 ix4_17 ix4_19];
zx5_5 = 14.432550251752380 - 2.947240851035613i;  ix5_5 =3.686215408819882 - 1.602787347867338i;
zx5_7 =12.602851533538663 + 0.474337372185490i;  ix5_7 =1.476407640709781 - 1.437037843364732i;
zx5_11 =9.899739489135682 - 7.239473737467123i;  ix5_11 =-0.700897223000984 + 1.224247812306092i;
zx5_13 =14.071742952726909 - 6.418379408966802i;  ix5_13 =-0.131094078179754 + 1.002854361457928i;
zx5_17 = 0.406552364598772 - 7.215260598594116i;  ix5_17 =-0.040881148858431 - 0.555596124427189i;
zx5_19 =4.198210601679564 - 7.632588716452486i;  ix5_19 =-0.241921889630067 - 0.505083923206618i;
Yx5=[1./zx5_5 1./zx5_7 1./zx5_11 1./zx5_13 1./zx5_17 1./zx5_19];
Ix5=[ix5_5 ix5_7 ix5_11 ix5_13 ix5_17 ix5_19];
zx8_5 = 5.140835732702407 + 0.196248098889220i;  ix8_5 =6.072732121619697 - 2.556245935711456i;
zx8_7 =3.790753658539414 + 0.050823187792922i;  ix8_7 =2.496325622904224 - 2.220255811077135i;
zx8_11 =4.170072579080492 - 0.883911441472573i;  ix8_11 =-1.091298044939296 + 1.902839069928534i;
zx8_13 =3.281818170124402 + 0.004144691848796i;  ix8_13 =-0.334773378599454 + 1.694994503276506i;
zx8_17 =2.215152814298058 - 2.732282055668740i;  ix8_17 =0.228373331632453 - 0.730346353574021i;
zx8_19 =2.197473580464988 - 1.506428479601233i;  ix8_19 =0.010655556197991 - 0.845876720037802i;
Yx8=[1./zx8_5 1./zx8_7 1./zx8_11 1./zx8_13 1./zx8_17 1./zx8_19];
Ix8=[ix8_5 ix8_7 ix8_11 ix8_13 ix8_17 ix8_19];
zx10_5 =8.153482744676479 - 1.315549276493670i;  ix10_5 =4.205047766526358 - 1.467077321321344i;
zx10_7 =6.432254610153609 - 1.472760593980618i;  ix10_7 =1.818092297173049 - 1.345594942485625i;
zx10_11 =5.532006762826680 - 3.871921738658342i;  ix10_11 =-0.960067295365801 + 1.244951723599906i;
zx10_13 =4.928354187917078 - 3.340409629910139i;  ix10_13 =-0.436337105133895 + 1.052310152313838i;
zx10_17 =0.176762697980927 - 4.897088232422035i;  ix10_17 =0.172110842349429 - 0.531267966114282i;
zx10_19 =0.632676134862006 - 3.988018163932576i;  ix10_19 =0.058177248982406 - 0.479660761364542i;
Yx10=[1./zx10_5 1./zx10_7 1./zx10_11 1./zx10_13 1./zx10_17 1./zx10_19];
Ix10=[ix10_5 ix10_7 ix10_11 ix10_13 ix10_17 ix10_19];
zx12_5 =3.659998214287613 - 0.825530227373464i;  ix12_5 = 7.260881814814734 - 0.444765587542174i;
zx12_7 =2.774145311532188 - 1.221128904398895i;  ix12_7 =3.591611404367872 - 0.561967367885275i;
zx12_11 =2.560070374846605 - 2.292234493514306i;  ix12_11 =-2.466085284354701 + 0.795013708860319i;
zx12_13 =2.048048692534189 - 2.154664994587837i;  ix12_13 =-1.789447844676955 + 0.658311830394829i;
zx12_17 =-0.523934539637120 - 2.970000923448040i;  ix12_17 =1.335931056526051 - 0.216442613167518i;
zx12_19 =-0.340021138285627 - 2.846163000747687i;  ix12_19 =1.043085203259761 - 0.302875805786454i;
Yx12=[1./zx12_5 1./zx12_7 1./zx12_11 1./zx12_13 1./zx12_17 1./zx12_19];
Ix12=[ix12_5 ix12_7 ix12_11 ix12_13 ix12_17 ix12_19];
zx14_5 =4.847915629901945 - 1.314958378862036i;  ix14_5 =5.290075256582525 - 0.010468860278532i;
zx14_7 = 3.582850307800518 - 1.939631870244177i;  ix14_7 =2.695022801895260 - 0.138653395111538i;
zx14_11 =3.078250174727313 - 3.508310161809683i;  ix14_11 =-1.889692689482565 + 0.354621833651008i;
zx14_13 =2.141085549162979 - 3.299558158648369i;  ix14_13 =-1.456489589961182 + 0.262334642613101i;
zx14_17 =-1.720550817606178 - 3.766567313033664i;  ix14_17 =1.054807478081907 + 0.045537915789931i;
zx14_19 =-1.677597107413330 - 3.177960212655177i;  ix14_19 =0.908788824642675 - 0.010002524172601i;
Yx14=[1./zx14_5 1./zx14_7 1./zx14_11 1./zx14_13 1./zx14_17 1./zx14_19];
Ix14=[ix14_5 ix14_7 ix14_11 ix14_13 ix14_17 ix14_19];
%--线路阻抗和对地电容
Zn=[0.001 0.001 0.001 0.001 0.001 0.001];
Bg=[5e-4*pi*0.00095i 7e-4*pi*0.00095i 11e-4*pi*0.00095i 13e-4*pi*0.00095i 17e-4*pi*0.00095i 19e-4*pi*0.00095i];
Zg0=[0.0188+0.0184*pi*5i 0.0188+0.0184*pi*7i 0.0188+0.0184*pi*11i 0.0188+0.0184*pi*13i 0.0188+0.0184*pi*17i 0.0188+0.0184*pi*19i];
Zg=Zn./(Zn.*Bg+1)+Zg0;
Vg=[0 0 0+0i 0+0i 0+0i 0+0i];
Yg=1./Zg;
Ug=Vg./(Zn.*Bg+1);
B1_4=[5e-4*pi*0.039i 7e-4*pi*0.039i 11e-4*pi*0.039i 13e-4*pi*0.039i 17e-4*pi*0.039i 19e-4*pi*0.039i];
YL1_4=[1/(0.0804+0.0102*pi*5i) 1/(0.0804+0.0102*pi*7i) 1/(0.0804+0.0102*pi*11i) 1/(0.0804+0.0102*pi*13i) 1/(0.0804+0.0102*pi*17i) 1/(0.0804+0.0102*pi*19i)];
B3_4=[5e-4*pi*0.023i 7e-4*pi*0.023i 11e-4*pi*0.023i 13e-4*pi*0.023i 17e-4*pi*0.023i 19e-4*pi*0.023i];
YL3_4=[1/(0.0774+0.0072*pi*5i) 1/(0.0774+0.0072*pi*7i) 1/(0.0774+0.0072*pi*11i) 1/(0.0774+0.0072*pi*13i) 1/(0.0774+0.0072*pi*17i) 1/(0.0774+0.0072*pi*19i)];
B2_3=[5e-4*pi*0.01725i 7e-4*pi*0.01725i 11e-4*pi*0.01725i 13e-4*pi*0.01725i 17e-4*pi*0.01725i 19e-4*pi*0.01725i];
YL2_3=[1/(0.05805+0.0054*pi*5i) 1/(0.05805+0.0054*pi*7i) 1/(0.05805+0.0054*pi*11i) 1/(0.05805+0.0054*pi*13i) 1/(0.05805+0.0054*pi*17i) 1/(0.05805+0.0054*pi*19i)];
B4_5=[5e-4*pi*0.02875i 7e-4*pi*0.02875i 11e-4*pi*0.02875i 13e-4*pi*0.02875i 17e-4*pi*0.02875i 19e-4*pi*0.02875i];
YL4_5=[1/(0.09675+0.009*pi*5i) 1/(0.09675+0.009*pi*7i) 1/(0.09675+0.009*pi*11i) 1/(0.09675+0.009*pi*13i) 1/(0.09675+0.009*pi*17i) 1/(0.09675+0.009*pi*19i)];
B5_6=B2_3;YL5_6=YL2_3;
B4_7=[5e-4*pi*0.026i 7e-4*pi*0.026i 11e-4*pi*0.026i 13e-4*pi*0.026i 17e-4*pi*0.026i 19e-4*pi*0.026i];
YL4_7=[1/(0.0536+0.0068*pi*5i) 1/(0.0536+0.0068*pi*7i) 1/(0.0536+0.0068*pi*11i) 1/(0.0536+0.0068*pi*13i) 1/(0.0536+0.0068*pi*17i) 1/(0.0536+0.0068*pi*19i)];
B7_10=[5e-4*pi*0.0325i 7e-4*pi*0.0325i 11e-4*pi*0.0325i 13e-4*pi*0.0325i 17e-4*pi*0.0325i 19e-4*pi*0.0325i];
YL7_10=[1/(0.067+0.0085*pi*5i) 1/(0.067+0.0085*pi*7i) 1/(0.067+0.0085*pi*11i) 1/(0.067+0.0085*pi*13i) 1/(0.067+0.0085*pi*17i) 1/(0.067+0.0085*pi*19i)];
B8_9=B4_5;YL8_9=YL4_5;
B9_10=B3_4;YL9_10=YL3_4;
B10_11=B3_4;YL10_11=YL3_4;
B10_13=B7_10;YL10_13=YL7_10;
B9_14=B7_10;YL9_14=YL7_10;
B11_12=B4_5;YL11_12=YL4_5;

%--建立节点导纳矩阵
Y11=B1_4+YL1_4+Yg; Y14=-YL1_4;Y41=Y14;
Y22=B2_3+YL2_3; Y23=-YL2_3;Y32=Y23;
Y33=B2_3+B3_4+YL2_3+YL3_4+Yx3; Y34=-YL3_4;Y43=Y34;
Y44=B1_4+B3_4+B4_5+B4_7+YL1_4+YL3_4+YL4_5+YL4_7+Yx4; Y45=-YL4_5;Y54=Y45; Y47=-YL4_7;Y74=Y47;
Y55=B4_5+B5_6+YL4_5+YL5_6+Yx5; Y56=-YL5_6;Y65=Y56;
Y66=B5_6+YL5_6;
Y77=B4_7+B7_10+YL4_7+YL7_10; Y710=-YL7_10;Y107=Y710;
Y88=B8_9+YL8_9+Yx8; Y89=-YL8_9;Y98=Y89;
Y99=B8_9+B9_10+B9_14+YL8_9+YL9_10+YL9_14; Y910=-YL9_10;Y109=Y910; Y914=-YL9_14;Y149=Y914;
Y1010=B7_10+B9_10+B10_11+B10_13+YL7_10+YL9_10+YL10_11+YL10_13+Yx10; Y1011=-YL10_11;Y1110=Y1011; Y1013=-YL10_13;Y1310=Y1013;
Y1111=B10_11+B11_12+YL10_11+YL11_12; Y1112=-YL11_12;Y1211=Y1112;
Y1212=B11_12+YL11_12+Yx12;
Y1313=B10_13+YL10_13;
Y1414=B9_14+YL9_14+Yx14;

%--建立节点电压、谐波电导、谐波电流补偿系数、PV注入电流变量
U1=sdpvar(1,6, 'full', 'complex');U2=sdpvar(1,6, 'full', 'complex');%节点电压
U3=sdpvar(1,6, 'full', 'complex');U4=sdpvar(1,6, 'full', 'complex');
U5=sdpvar(1,6, 'full', 'complex');U6=sdpvar(1,6, 'full', 'complex');
U7=sdpvar(1,6, 'full', 'complex');U8=sdpvar(1,6, 'full', 'complex');
U9=sdpvar(1,6, 'full', 'complex');U10=sdpvar(1,6, 'full', 'complex');
U11=sdpvar(1,6, 'full', 'complex');U12=sdpvar(1,6, 'full', 'complex');
U13=sdpvar(1,6, 'full', 'complex');U14=sdpvar(1,6, 'full', 'complex');
UU3=sdpvar(1,6, 'full', 'complex');%有PV补偿的节点3
G3=sdpvar(1,6, 'full'); K3=sdpvar(1,6, 'full');
Ipv3=sdpvar(1,6, 'full', 'complex');
UU12=sdpvar(1,6, 'full', 'complex');%有PV补偿的节点12
G12=sdpvar(1,6, 'full'); K12=sdpvar(1,6, 'full');
Ipv12=sdpvar(1,6, 'full', 'complex');
UU14=sdpvar(1,6, 'full', 'complex');%有PV补偿的节点14
G14=sdpvar(1,6, 'full'); K14=sdpvar(1,6, 'full');
Ipv14=sdpvar(1,6, 'full', 'complex');
vmax=22;ilim=5;
constr1 = [abs(real(U1))<=vmax,abs(imag(U1))<=vmax];%节点谐波电压不能太高，否则计算时间长
constr1 = [constr1;abs(real(U2))<=vmax,abs(imag(U2))<=vmax];
constr1 = [constr1;abs(real(U3))<=vmax,abs(imag(U3))<=vmax];
constr1 = [constr1;abs(real(U4))<=vmax,abs(imag(U4))<=vmax];
constr1 = [constr1;abs(real(U5))<=vmax,abs(imag(U5))<=vmax];
constr1 = [constr1;abs(real(U6))<=vmax,abs(imag(U6))<=vmax];
constr1 = [constr1;abs(real(U7))<=vmax,abs(imag(U7))<=vmax];
constr1 = [constr1;abs(real(U8))<=vmax,abs(imag(U8))<=vmax];
constr1 = [constr1;abs(real(U9))<=vmax,abs(imag(U9))<=vmax];
constr1 = [constr1;abs(real(U10))<=vmax,abs(imag(U10))<=vmax];
constr1 = [constr1;abs(real(U11))<=vmax,abs(imag(U11))<=vmax];
constr1 = [constr1;abs(real(U12))<=vmax,abs(imag(U12))<=vmax];
constr1 = [constr1;abs(real(U13))<=vmax,abs(imag(U13))<=vmax];
constr1 = [constr1;abs(real(U14))<=vmax,abs(imag(U14))<=vmax];
%--谐波潮流
 for h=1:1:6
 constr1=[constr1;Y11(h)*U1(h)+Y14(h)*U4(h)==Ug(h)*Yg(h)];%谐波潮流
 constr1=[constr1;Y22(h)*U2(h)+Y23(h)*U3(h)==0];%谐波潮流
 constr1=[constr1;Y41(h)*U1(h)+Y43(h)*U3(h)+Y44(h)*U4(h)+Y45(h)*U5(h)+Y47(h)*U7(h)==Ix4(h)];%谐波潮流
 constr1=[constr1;Y54(h)*U4(h)+Y55(h)*U5(h)+Y56(h)*U6(h)==Ix5(h)];%谐波潮流
 constr1=[constr1;Y65(h)*U5(h)+Y66(h)*U6(h)==0];%谐波潮流
 constr1=[constr1;Y74(h)*U4(h)+Y77(h)*U7(h)+Y710(h)*U10(h)==0];%谐波潮流
 constr1=[constr1;Y88(h)*U8(h)+Y89(h)*U9(h)==Ix8(h)];%谐波潮流
 constr1=[constr1;Y98(h)*U8(h)+Y99(h)*U9(h)+Y910(h)*U10(h)+Y914(h)*U14(h)==0];%谐波潮流
 constr1=[constr1;Y107(h)*U7(h)+Y109(h)*U9(h)+Y1010(h)*U10(h)+Y1011(h)*U11(h)+Y1013(h)*U13(h)==Ix10(h)];%谐波潮流
 constr1=[constr1;Y1110(h)*U10(h)+Y1111(h)*U11(h)+Y1112(h)*U12(h)==0];%谐波潮流
 constr1=[constr1;Y1310(h)*U10(h)+Y1313(h)*U13(h)==0];%谐波潮流
  

  constr1=[constr1;Y149(h)*U9(h)+(Y1414(h)+G14(h))*U14(h)==Ix14(h)];%谐波潮流
 constr1=[constr1;(abs(U14(h))^2-(0.0025*311)^2)==UU14(h)];%节点谐波电压不能太低
 constr1=[constr1;UU14(h)*G14(h)>=0];%节点谐波电压不能太低
 constr1=[constr1;G14(h)>=0;G14(h)<=2.5];%虚拟电导
 constr1=[constr1;U14(h).*G14(h)==Ipv14(h)];%PV补偿谐波电流//// 

  constr1=[constr1;Y32(h)*U2(h)+(Y33(h))*U3(h)+Y34(h)*U4(h)==(1-K3(h))*Ix3(h)];%谐波潮流电流
 constr1=[constr1;K3(h)*Ix3(h)==Ipv3(h)];%PV补偿谐波电流
 constr1=[constr1;K3(h)>=0;K3(h)<=1];%电流补偿系数
  constr1=[constr1;Y1211(h)*U11(h)+(Y1212(h))*U12(h)==(1-K12(h))*Ix12(h)];%谐波潮流电流
 constr1=[constr1;K12(h)*Ix12(h)==Ipv12(h)];%PV补偿谐波电流
 constr1=[constr1;K12(h)>=0;K12(h)<=1];%电流补偿系数
 %  constr1=[constr1;Y149(h)*U9(h)+(Y1414(h))*U14(h)==(1-K14(h))*Ix14(h)];%谐波潮流电流
 % constr1=[constr1;K14(h)*Ix14(h)==Ipv14(h)];%PV补偿谐波电流
 % constr1=[constr1;K14(h)>=0;K14(h)<=1];%电流补偿系数
 end
%--谐波电流限幅
constr1 = [constr1;abs(Ipv3(1))^2+abs(Ipv3(2))^2+abs(Ipv3(3))^2+abs(Ipv3(4))^2+abs(Ipv3(5))^2+abs(Ipv3(6))^2<=2*ilim*ilim];
constr1 = [constr1;abs(Ipv12(1))^2+abs(Ipv12(2))^2+abs(Ipv12(3))^2+abs(Ipv12(4))^2+abs(Ipv12(5))^2+abs(Ipv12(6))^2<=2*ilim*ilim];
constr1 = [constr1;abs(Ipv14(1))^2+abs(Ipv14(2))^2+abs(Ipv14(3))^2+abs(Ipv14(4))^2+abs(Ipv14(5))^2+abs(Ipv14(6))^2<=2*ilim*ilim];
%--节点vTHD
THD1=sqrt(abs(U1(1))^2+abs(U1(2))^2+abs(U1(3))^2+abs(U1(4))^2+abs(U1(5))^2+abs(U1(6))^2);
THD2=sqrt(abs(U2(1))^2+abs(U2(2))^2+abs(U2(3))^2+abs(U2(4))^2+abs(U2(5))^2+abs(U2(6))^2);
THD3=sqrt(abs(U3(1))^2+abs(U3(2))^2+abs(U3(3))^2+abs(U3(4))^2+abs(U3(5))^2+abs(U3(6))^2);
THD4=sqrt(abs(U4(1))^2+abs(U4(2))^2+abs(U4(3))^2+abs(U4(4))^2+abs(U4(5))^2+abs(U4(6))^2);
THD5=sqrt(abs(U5(1))^2+abs(U5(2))^2+abs(U5(3))^2+abs(U5(4))^2+abs(U5(5))^2+abs(U5(6))^2);
THD6=sqrt(abs(U6(1))^2+abs(U6(2))^2+abs(U6(3))^2+abs(U6(4))^2+abs(U6(5))^2+abs(U6(6))^2);
THD7=sqrt(abs(U7(1))^2+abs(U7(2))^2+abs(U7(3))^2+abs(U7(4))^2+abs(U7(5))^2+abs(U7(6))^2);
THD8=sqrt(abs(U8(1))^2+abs(U8(2))^2+abs(U8(3))^2+abs(U8(4))^2+abs(U8(5))^2+abs(U8(6))^2);
THD9=sqrt(abs(U9(1))^2+abs(U9(2))^2+abs(U9(3))^2+abs(U9(4))^2+abs(U9(5))^2+abs(U9(6))^2);
THD10=sqrt(abs(U10(1))^2+abs(U10(2))^2+abs(U10(3))^2+abs(U10(4))^2+abs(U10(5))^2+abs(U10(6))^2);
THD11=sqrt(abs(U11(1))^2+abs(U11(2))^2+abs(U11(3))^2+abs(U11(4))^2+abs(U11(5))^2+abs(U11(6))^2);
THD12=sqrt(abs(U12(1))^2+abs(U12(2))^2+abs(U12(3))^2+abs(U12(4))^2+abs(U12(5))^2+abs(U12(6))^2);
THD13=sqrt(abs(U13(1))^2+abs(U13(2))^2+abs(U13(3))^2+abs(U13(4))^2+abs(U13(5))^2+abs(U13(6))^2);
THD14=sqrt(abs(U14(1))^2+abs(U14(2))^2+abs(U14(3))^2+abs(U14(4))^2+abs(U14(5))^2+abs(U14(6))^2);
THDD=THD1+THD2+THD3+THD4+THD5+THD6+THD7+THD8+THD9+THD10+THD11+THD12+THD13+THD14;
constraints = constr1;
objective = THDD;
% 创建问题对象
   ops = sdpsettings('solver', 'gurobi','verbose',1);
%   ops = sdpsettings('solver', 'gurobi','verbose',1,'gurobi.TimeLimit',30,'gurobi.MIPGap',0.06);
% ops.gurobi.TimeLimit = 90;%设置求解时间
% ops.gurobi.MIPGap = 0.1;%设置求解容差
%  ops.gurobi.OutputFlag = 1;
%  ops.gurobi.PresolveTime = 30;
%  ops.gurobi.Heuristics = 0.5;  % 降低启发式搜索强度
%  ops.gurobi.NumericFocus = 3;   % 最高数值严格性
% ops.gurobi.ScaleFlag = 1;      % 启用自动缩放系数
% params.Presolve = 2;           % 加强预处理
% ops.gurobi.OptimalityTol = 1e-6; 
 resul = optimize(constraints, objective, ops);

% 检查问题求解状态
%  model = gurobi.Model('constraints, objective');
%  ops.params.TimeLimit = 600; % 单位：秒（例如60秒后停止）
%  result = gurobi(problem); % 执行求解

if resul.problem == 0 % 求解成功 
    optimal_solution = value(G3);
%     format long;
     disp(['节点3谐波电导：', num2str(value(G3))]);
    disp(['节点3电流补偿系数：', num2str(value(K3))]);
    disp(['节点3各次谐波电压：',num2str(value(U3))]);
     disp(['节点12谐波电导：', num2str(value(G12))]);
    disp(['节点12电流补偿系数：', num2str(value(K12))]);
    disp(['节点12各次谐波电压：',num2str(value(U12))]);
     disp(['节点14谐波电导：', num2str(value(G14))]);
    disp(['节点14电流补偿系数：', num2str(value(K14))]);
    disp(['节点14各次谐波电压：',num2str(value(U14))]);
     disp(['节点3各次电压幅值：',num2str(value(abs(U3)))]);
    disp(['节点12各次电压幅值：',num2str(value(abs(U12)))]);
    disp(['节点14各次电压幅值：',num2str(value(abs(U14)))]);
     disp(['节点1THD:',num2str(value(THD1)/3.10)]);
    disp(['节点2THD:',num2str(value(THD2)/3.10)]);
    disp(['节点3THD:',num2str(value(THD3)/3.10)]);
    disp(['节点4THD:',num2str(value(THD4)/3.10)]);
    disp(['节点5THD:',num2str(value(THD5)/3.10)]);
    disp(['节点6THD:',num2str(value(THD6)/3.10)]);
    disp(['节点7THD:',num2str(value(THD7)/3.10)]);
    disp(['节点8THD:',num2str(value(THD8)/3.10)]);
    disp(['节点9THD:',num2str(value(THD9)/3.10)]);
    disp(['节点10THD:',num2str(value(THD10)/3.10)]);
    disp(['节点11THD:',num2str(value(THD11)/3.10)]);
    disp(['节点12THD:',num2str(value(THD12)/3.10)]);
    disp(['节点13THD:',num2str(value(THD13)/3.10)]);
    disp(['节点14THD:',num2str(value(THD14)/3.10)]);
    disp(['总谐波电压：', num2str(value(objective)),' 平均THD:',num2str(value(objective)/(3.10*14))]);
elseif resul.problem == 3  % 超时终止 
disp(['总谐波电压：', num2str(value(objective)),' 平均THD:',num2str(value(objective)/(3.10*14))]);
     disp(['节点3谐波电导：', num2str(value(G3))]);
    disp(['节点3电流补偿系数：', num2str(value(K3))]);
    disp(['节点3各次谐波电压：',num2str(value(U3))]);
     disp(['节点12谐波电导：', num2str(value(G12))]);
    disp(['节点12电流补偿系数：', num2str(value(K12))]);
    disp(['节点12各次谐波电压：',num2str(value(U12))]);
     disp(['节点14谐波电导：', num2str(value(G14))]);
    disp(['节点14电流补偿系数：', num2str(value(K14))]);
    disp(['节点14各次谐波电压：',num2str(value(U14))]); 
    else
    % 求解失败
    disp('Optimization failed');
end
